Merge pull request #36 from cloudflare/monorepo-extraction
Code extraction into separate packages
